app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY published_at DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate(:page => params[:page],:per_page => 5, :order => "published_at DESC")

SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1
---
  def show
    @article = Article.find(params[:id])

SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO "articles" ("published_at", "title", "body", "created_at", "updated_at") VALUES ('2011-01-04 13:47:00.000000', 'hhhahahaha', 'jajajajnjkkkkkkkkkkkkkkkkkСвойство clear Свойство clear управляет поведением последовательностью всплывающих элементов документа.По умолчанию последовательные элементы смещаются вверх, заполняя доступное пространство, которое освобождается, если бокс всплывает в сторону. Посмотрите на предыдущий пример, где текст автоматически смещается вверх вдоль изображения Била Гейтса.Свойство clear может иметь значения left, right, both или none. Принцип таков, что если clear, например, имеет для бокса значение both, то верхний край рамки этого бокса всегда будет находиться под нижним краем поля возможных всплывающих сверху боксов.', '2011-01-04 13:48:08.437745', '2011-01-04 13:48:08.437745')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1
UPDATE "articles" SET "body" = 'Alenuwka bila pervoy jenwinoy,dokazavwey,wto vse mujiki kozli stoit im tolko napitsa.11', "updated_at" = '2011-01-05 14:38:22.649185' WHERE ("articles"."id" = 1)
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])

SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 7) LIMIT 1
DELETE FROM "articles" WHERE ("articles"."id" = 7)
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy