app/controllers/comments_controller.rb

INSERT INTO "comments" ("name", "email", "updated_at", "body", "article_id", "created_at") VALUES ('jony', '686@rambler.ru', '2011-01-07 13:47:54.926455', 'Hello..', 2, '2011-01-07 13:47:54.926455')
---
  def create
    @comment = @article.comments.new(params[:comment])
    if @comment.save

SELECT "comments".* FROM "comments" WHERE ("comments".article_id = 10) AND ("comments"."id" = 12) LIMIT 1
DELETE FROM "comments" WHERE ("comments"."id" = 12)
---
  def destroy
    @comment = @article.comments.find(params[:id])
    @comment.destroy

SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 10) LIMIT 1
---
    def load_article
      @article = Article.find(params[:article_id])