app/controllers/store_controller.rb

SELECT "articles".* FROM "articles" ORDER BY published_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
  @articles = Article.paginate(:page => params[:page],:per_page => 5, :order => "published_at DESC")

SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1
---
  def show
    @article = Article.find(params[:id])